kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_5_0/ESP32-S3-Station-V_7_5_0.ino
void drawHoldProgressHUD(unsigned long holdDur) {
  int boxX = 6, boxY = 100, boxW = 160, boxH = 100;
  tft.fillRoundRect(boxX, boxY, boxW, boxH, 8, THEME_NAVY);
  tft.drawRoundRect(boxX, boxY, boxW, boxH, 8, THEME_CYAN);

  int barX = boxX + 15;
  int barY = boxY + 48;
  int barW = 130;
  int barH = 12;

  if (holdDur < 3000) {
    int fill = map(holdDur, 400, 3000, 0, barW);
    if (fill < 0) fill = 0;
    if (fill > barW) fill = barW;

    drawCenteredString("BUTTON HOLDING", boxY + 12, 1, THEME_SKYBLUE, THEME_NAVY);
    drawCenteredString("-> CALIBRATE (3s)", boxY + 28, 1, COLOR_YELLOW, THEME_NAVY);
    tft.drawRect(barX, barY, barW, barH, COLOR_WHITE);
    tft.fillRect(barX + 1, barY + 1, fill, barH - 2, THEME_PINK);
    drawCenteredString("Release <3s = Cancel", boxY + 82, 1, ST77XX_LIGHTGREY, THEME_NAVY);
  }
  else if (holdDur < 5000) {
    int fill = map(holdDur, 3000, 5000, 0, barW);
    if (fill < 0) fill = 0;
    if (fill > barW) fill = barW;

    drawCenteredString("RELEASE = CALIB", boxY + 12, 1, COLOR_GREEN, THEME_NAVY);
    drawCenteredString("-> CREDITS (5s)", boxY + 28, 1, THEME_PINK, THEME_NAVY);
    tft.drawRect(barX, barY, barW, barH, COLOR_WHITE);
    tft.fillRect(barX + 1, barY + 1, fill, barH - 2, THEME_CYAN);
  }
  else {
    drawCenteredString(">> CREDITS READY <<", boxY + 14, 1, COLOR_GREEN, THEME_NAVY);
    drawCenteredString("RELEASE TO VIEW", boxY + 30, 1, COLOR_YELLOW, THEME_NAVY);
    tft.drawRect(barX, barY, barW, barH, COLOR_WHITE);
    tft.fillRect(barX + 1, barY + 1, barW - 2, barH - 2, COLOR_GREEN);
  }
}

int sampleSensorAveragePrecise(int samples = 40) {
  long sum = 0;
  for (int i = 0; i < samples; i++) {
    sum += analogRead(SENSOR_AO_PIN);
    delayMicroseconds(500);
  }
  return (int)(sum / samples);
}

int waitAndMonitorSensorStep(const char* stepTitle, const char* stepDescTh, const char* stepDescEn, uint16_t boxColor) {
  noTone(BUZZER_PIN);
  buzzerBeepUntil = 0;

  tft.fillRoundRect(6, 36, 160, 160, 8, THEME_DARKBOX);
  tft.drawRoundRect(6, 36, 160, 160, 8, boxColor);
  drawCenteredString(stepTitle, 44, 1, COLOR_YELLOW, THEME_DARKBOX);
  drawCenteredString(stepDescEn, 60, 2, COLOR_WHITE, THEME_DARKBOX);
  // หมายเหตุ: ฟอนต์ Adafruit GFX ไม่มีอักษรไทย จึงแสดงคำอธิบายภาษาอังกฤษบนจอ
  (void)stepDescTh;

  tft.fillRoundRect(20, 102, 132, 44, 6, THEME_NAVY);
  tft.drawRoundRect(20, 102, 132, 44, 6, boxColor);
  drawCenteredString("SENSOR LIVE ADC", 106, 1, THEME_SKYBLUE, THEME_NAVY);
  drawCenteredString("Click Button >>", 176, 1, COLOR_WHITE, THEME_DARKBOX);

  unsigned long lastAdcUpdate = 0;
  int lastVal = -1;
  while (digitalRead(BTN_PIN) == HIGH) {
    if (millis() - lastAdcUpdate >= 60) {
      lastAdcUpdate = millis();
      int liveAdc = analogRead(SENSOR_AO_PIN);
      if (liveAdc != lastVal) {
        lastVal = liveAdc;
        tft.fillRect(24, 120, 124, 20, THEME_NAVY);
        drawCenteredString(String(liveAdc), 120, 2, COLOR_WHITE, THEME_NAVY);
      }
    }
    delay(5);
  }

  modalSafeBeep(2400, 40);
  while (digitalRead(BTN_PIN) == LOW) delay(10);
  delay(60);

  tft.fillRect(20, 102, 132, 44, THEME_NAVY);
  drawCenteredString("SAMPLING...", 118, 1, COLOR_YELLOW, THEME_NAVY);
  int avgVal = sampleSensorAveragePrecise(50);
  modalSafeBeep(1800, 60);

  return avgVal;
}

void executeButtonCalibrationWizard() {
  noTone(BUZZER_PIN);
  buzzerBeepUntil = 0;

  tft.fillScreen(THEME_BG);
  tft.fillRect(0, 0, 172, 28, THEME_PINK);
  drawCenteredString("CALIBRATION WIZARD", 8, 1, COLOR_WHITE, THEME_PINK);

  int newLiquid = waitAndMonitorSensorStep("STEP 1 OF 2", "(กระเปาะมีสารน้ำ)", "FILL LIQUID", THEME_SKYBLUE);
  int newAir    = waitAndMonitorSensorStep("STEP 2 OF 2", "(กระเปาะเปล่าไม่มีน้ำ)", "EMPTY CHAMBER", THEME_PINK);

  int diff = abs(newLiquid - newAir);
  tft.fillRoundRect(6, 204, 160, 108, 8, THEME_NAVY);
  tft.drawRoundRect(6, 204, 160, 108, 8, (diff >= 80) ? COLOR_GREEN : COLOR_RED);

  if (diff >= 80) {
    valLiquid     = newLiquid;
    valAir        = newAir;
    dropThreshold = (valLiquid + valAir) / 2;
    hysteresis    = (int)(diff * 0.20);
    if (hysteresis < 60)  hysteresis = 60;
    if (hysteresis > 300) hysteresis = 300;

    stationPrefs.begin("st_cal", false);
    stationPrefs.putInt("v_liq", valLiquid);
    stationPrefs.putInt("v_air", valAir);
    stationPrefs.putInt("th", dropThreshold);
    stationPrefs.putInt("hys", hysteresis);
    stationPrefs.end();

    drawCenteredString("CALIBRATION OK!", 212, 1, COLOR_GREEN, THEME_NAVY);
    drawCenteredString("TH:" + String(dropThreshold) + " HYS:" + String(hysteresis), 232, 1, COLOR_WHITE, THEME_NAVY);
    modalSafeBeep(2000, 100);
    delay(100);
    modalSafeBeep(2500, 150);
    delay(1500);
  } else {
    // ไม่เขียนทับค่าเดิมเมื่อ Calibrate ไม่ผ่าน
    drawCenteredString("FAILED: DIFF LOW!", 216, 1, COLOR_RED, THEME_NAVY);
    drawCenteredString("Keep previous values", 236, 1, COLOR_WHITE, THEME_NAVY);
    modalSafeBeep(800, 200);
    delay(1500);
  }
  // ตรวจจับหยดหยุดทำงานระหว่าง Wizard -> ไม่ให้นับเป็นสายพับทันที
  if (hasFirstDropOccurred) { lastDropTimestamp = millis(); skipNextInterval = true; }
  lastUserActivityTime = millis();
  stateNeedsRedraw = true;
}

// ----------------------------------------------------------------------------
// ESP-NOW Receive Callback (รับ Sync จาก Host)
// ----------------------------------------------------------------------------
#if defined(ESP_IDF_VERSION) && ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
void OnTimeSyncRecv(const esp_now_recv_info_t *info, const uint8_t *incomingDataBytes, int len) {
  int rssi = (info && info->rx_ctrl) ? info->rx_ctrl->rssi : -55;
#else
void OnTimeSyncRecv(const uint8_t *mac, const uint8_t *incomingDataBytes, int len) {
  int rssi = -55;
#endif
  if (len != sizeof(struct_host_sync)) return;   // แพ็กเก็ตของ Station อื่น (22 bytes) จะถูกกรองออก

  struct_host_sync syncData;
  memcpy(&syncData, incomingDataBytes, sizeof(syncData));
  lastHostRssi = rssi;
  lastHostRecvTime = millis();
  isHostOnline = true;
  hostReportedChannel = syncData.hostChannel;

  if (syncData.epochTime > 1600000000) {
    struct timeval tv = { (time_t)syncData.epochTime, 0 };
    settimeofday(&tv, NULL);
    isClockSynced = (syncData.isSynced == 1);
  }

  if (syncData.stationId == currentStationId) {
    targetRateHr  = syncData.targetRateHr;
    totalPlanMl   = syncData.totalPlanMl;
    hostAlertCode = syncData.alertCode;
    dropFactor    = safeDropFactor(syncData.dropFactor);
    nearEndPct    = safeNearPct(syncData.nearEndPct);
    hostNearEndAck = (syncData.flags & 0x01) != 0;
    if (hostNearEndAck) nearEndAckRequest = false;   // Host ยืนยันแล้ว

    if (knownResetSeq < 0) {
      knownResetSeq = syncData.resetSeq;          // ครั้งแรกหลังบูต: รับค่าโดยไม่รีเซ็ต
    } else if (syncData.resetSeq != (uint8_t)knownResetSeq) {
      knownResetSeq = syncData.resetSeq;
      pendingCounterReset = true;                  // ให้ loop() เป็นผู้รีเซ็ต
    }
  }
}

void applyCounterReset() {
  pendingCounterReset = false;
  totalDrops = 0;
  periodDropsCounter = 0;
  totalVolumeMl = 0;
  currentFlowRate_ml_hr = 0;
  currentGttMin = 0;
  hasFirstDropOccurred = false;
  skipNextInterval = false;
  isDropFalling = false;
  snoozeUntilTime = 0;
  hostAlertCode = ALERT_NONE;
  hostNearEndAck = false;
  nearEndAckRequest = false;
  nearNextChimeTime = 0;
  nearChimeRemaining = 0;
  if (currentState == STATE_EMERGENCY || currentState == STATE_NEAR_END_NOTICE) currentState = STATE_NORMAL_VIEW;
  resetTrendData();                 // เริ่มถุงใหม่ = เริ่มกราฟแนวโน้มใหม่
  stateNeedsRedraw = true;
  beepNonBlocking(2400, 120);
}

// ----------------------------------------------------------------------------
// ค้นหาช่องสัญญาณของ Host
// ----------------------------------------------------------------------------
void setEspNowChannel(uint8_t ch) {
  if (esp_wifi_set_channel(ch, WIFI_SECOND_CHAN_NONE) == ESP_OK) {
    espnowChannel = ch;
  }
}

void manageChannelHunting(unsigned long now) {
  if (isHostOnline) {
    if (espnowChannel != savedChannel) {
      savedChannel = espnowChannel;
      stationPrefs.begin("st_cfg", false);
      stationPrefs.putUChar("ch", savedChannel);
      stationPrefs.end();
    }
    return;
  }
  if (now < CHANNEL_SCAN_START_MS) return;
  if (currentState == STATE_CONFIG_ID) return;

  if (now - lastChannelHopTime >= CHANNEL_SCAN_DWELL_MS) {
    lastChannelHopTime = now;
    uint8_t next = (espnowChannel % MAX_WIFI_CHANNEL) + 1;
    setEspNowChannel(next);
  }
}

// ----------------------------------------------------------------------------
// ตรวจจับหยดน้ำ
// ----------------------------------------------------------------------------
void checkAnalogDrop() {
  if (!isRunning) return;

  int sensorValue = analogRead(SENSOR_AO_PIN);
  unsigned long now = millis();

  if (!dropState && (sensorValue < dropThreshold)) {
    if (now - lastDebounceTime > minDropInterval) {
      dropState = true;
      totalDrops++;
      periodDropsCounter++;
      lastDebounceTime = now;

      isDropFalling = true;
      dropFallStartTime = now;
      animDropY = CHAMBER_NOZZLE_Y;

