kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_5_0/ESP32-S3-Station-V_7_5_0.ino
void updatePage2Dynamic() {
  drawTopBar(false);

  String v1 = (targetRateHr > 0) ? String((int)(targetRateHr + 0.5f)) : String("--");
  String v2 = (totalPlanMl > 0) ? String((int)totalPlanMl) : String("--");
  String v3 = String((int)totalVolumeMl);
  String v4 = endClockText();

  if (v1 != cacheP2a) { cacheP2a = v1; drawStatCard(30,  "", v1, THEME_SKYBLUE, false); }
  if (v2 != cacheP2b) { cacheP2b = v2; drawStatCard(84,  "", v2, COLOR_WHITE,   false); }
  if (v3 != cacheP2c) { cacheP2c = v3; drawStatCard(138, "", v3, COLOR_WHITE,   false); }
  if (v4 != cacheP2d) { cacheP2d = v4; drawStatCard(192, "", v4, UI_GREEN,      false); }

  String foot = timeLeftText(false) + " left";
  String foot2 = (totalPlanMl > 0)
      ? ("NEXT BAG AT " + String(safeNearPct(nearEndPct)) + "%")
      : String("NEXT BAG AT --");
  String key = foot + foot2;
  if (key != cacheP2foot) {
    cacheP2foot = key;
    textCenterIn(padTo(foot, 12), 6, 160, 248, 2, COLOR_WHITE, THEME_BG);
    textCenterIn(padTo(foot2, 20), 6, 160, 274, 1, COLOR_ORANGE, THEME_BG);
  }
}

// ============================================================================
// หน้า 3: LINK — สถานะการเชื่อมต่อและเซนเซอร์
// ============================================================================
void drawPage3Framework() {
  tft.fillScreen(THEME_BG);
  drawTopBar(true);

  tft.fillRoundRect(6, 30, 160, 60, 6, UI_CARD);
  textAt("HOST LINK", 14, 36, 1, UI_DIM, UI_CARD);

  tft.fillRoundRect(6, 98, 160, 86, 6, UI_CARD);
  textAt("SENSOR", 14, 104, 1, UI_DIM, UI_CARD);

  tft.fillRoundRect(6, 192, 160, 76, 6, UI_CARD);
  textAt("DEVICE", 14, 198, 1, UI_DIM, UI_CARD);

  drawPageDots(2, 308);
  cacheP3a = ""; cacheP3b = ""; cacheP3c = "";
  stateNeedsRedraw = false;
}

void updatePage3Dynamic() {
  drawTopBar(false);

  String linkKey = String(isHostOnline ? 1 : 0) + ":" + String(lastHostRssi / 5) + ":" + String(espnowChannel);
  if (linkKey != cacheP3a) {
    cacheP3a = linkKey;
    textAt(padTo(isHostOnline ? "ONLINE" : "NO LINK", 8), 14, 50, 2, isHostOnline ? UI_GREEN : COLOR_RED, UI_CARD);
    tft.fillRect(134, 48, 20, 16, UI_CARD);
    drawLinkBars(136, 48, lastHostRssi, isHostOnline);
    String sub = isHostOnline ? ("CH " + String(espnowChannel) + "   " + String(lastHostRssi) + " dBm")
                              : ("SEARCHING CH " + String(espnowChannel));
    textAt(padTo(sub, 22), 14, 72, 1, UI_DIM, UI_CARD);
  }

  int adc = analogRead(SENSOR_AO_PIN);
  String sensorKey = String(adc / 4) + ":" + String(dropThreshold) + ":" + String(hysteresis);
  if (sensorKey != cacheP3b) {
    cacheP3b = sensorKey;
    textAt(padTo("ADC " + String(adc), 10), 14, 118, 2, dropState ? COLOR_YELLOW : COLOR_WHITE, UI_CARD);
    textAt(padTo("TH " + String(dropThreshold) + "   HYS " + String(hysteresis), 22), 14, 144, 1, UI_DIM, UI_CARD);
    textAt(padTo("LIQ " + String(valLiquid) + "   AIR " + String(valAir), 22), 14, 160, 1, UI_DIM, UI_CARD);
  }

  float bv = readStationBattery();
  String devKey = String(currentStationId) + ":" + String(safeDropFactor(dropFactor)) + ":" + String((int)(bv * 10)) + ":" + String(totalDrops);
  if (devKey != cacheP3c) {
    cacheP3c = devKey;
    char bed[12];
    snprintf(bed, sizeof(bed), "BED %02d", currentStationId);
    textAt(padTo(String(bed) + "  DF" + String(safeDropFactor(dropFactor)), 12), 14, 212, 2, COLOR_WHITE, UI_CARD);
    textAt(padTo("DROPS " + String(totalDrops), 22), 14, 236, 1, UI_DIM, UI_CARD);
    String pw = (bv > 0.5f) ? ("BATT " + String(bv, 2) + " V") : String("POWER USB");
    textAt(padTo("FW " APP_VERSION "   " + pw, 22), 14, 252, 1, UI_DIM, UI_CARD);
  }
}

// ============================================================================
// หน้า 4: TREND — กราฟแท่งอัตราไหลย้อนหลัง 30 นาที (แท่งละ 1 นาที)
// ============================================================================
#define CHART_X    12
#define CHART_BARW 5
#define CHART_TOP  56
#define CHART_BOT  196

float trendValueAt(int i) {
  int idx = (trendHead + i) % TREND_BARS;
  return trendHas[idx] ? trendBin[idx] : 0.0f;
}

bool trendValidAt(int i) {
  int idx = (trendHead + i) % TREND_BARS;
  return trendHas[idx];
}

float niceScale(float v) {
  float s = 20.0f;
  while (s < v && s < 400.0f) s += (s < 100.0f) ? 10.0f : (s < 200.0f ? 20.0f : 50.0f);
  return s;
}

void drawTrendChart() {
  const int chartH = CHART_BOT - CHART_TOP;
  const int chartW = TREND_BARS * CHART_BARW;

  float maxV = (targetRateHr > 0) ? targetRateHr : 1.0f;
  for (int i = 1; i < TREND_BARS; i++) if (trendValueAt(i) > maxV) maxV = trendValueAt(i);
  if (trendLive > maxV) maxV = trendLive;
  trendScale = niceScale(maxV * 1.1f);

  tft.fillRect(CHART_X - 3, CHART_TOP - 12, chartW + 6, chartH + 26, THEME_BG);
  for (int g = 1; g <= 3; g++) {
    int gy = CHART_BOT - (chartH * g) / 4;
    for (int x = CHART_X; x < CHART_X + chartW; x += 4) tft.drawPixel(x, gy, UI_CARD);
  }

  for (int i = 0; i < TREND_BARS; i++) {
    bool live = (i == TREND_BARS - 1);
    float v = live ? trendLive : trendValueAt(i + 1);
    bool has = live ? true : trendValidAt(i + 1);
    int x = CHART_X + i * CHART_BARW;
    int h = (int)((v / trendScale) * chartH);
    if (h > chartH) h = chartH;
    if (!has)        tft.drawFastHLine(x, CHART_BOT, CHART_BARW - 1, UI_CARD);
    else if (h <= 1) tft.drawFastHLine(x, CHART_BOT, CHART_BARW - 1, COLOR_RED);
    else             tft.fillRect(x, CHART_BOT - h, CHART_BARW - 1, h, live ? THEME_PINK : THEME_CYAN);
  }

  if (targetRateHr > 0) {                       // เส้นเป้าหมาย
    int ty = CHART_BOT - (int)((targetRateHr / trendScale) * chartH);
    if (ty < CHART_TOP) ty = CHART_TOP;
    for (int x = CHART_X; x < CHART_X + chartW; x += 6) tft.drawFastHLine(x, ty, 3, COLOR_YELLOW);
  }

  tft.drawFastHLine(CHART_X - 2, CHART_BOT + 1, chartW + 4, UI_LINE);
  textAt(padTo(String((int)trendScale) + " mL/h", 10), CHART_X, CHART_TOP - 12, 1, UI_DIM, THEME_BG);
  textAt("-30m", CHART_X, CHART_BOT + 6, 1, UI_DIM, THEME_BG);
  textRight("now", CHART_X + chartW, CHART_BOT + 6, 1, UI_DIM, THEME_BG);
  trendNeedsRedraw = false;
}

void drawTrendLiveBar() {
  if (trendLive > trendScale) { drawTrendChart(); return; }
  const int chartH = CHART_BOT - CHART_TOP;
  int x = CHART_X + (TREND_BARS - 1) * CHART_BARW;
  int h = (int)((trendLive / trendScale) * chartH);
  if (h > chartH) h = chartH;
  tft.fillRect(x, CHART_TOP, CHART_BARW - 1, chartH, THEME_BG);
  if (targetRateHr > 0) {                       // คืนเส้นเป้าหมายในช่วงที่ลบไป
    int ty = CHART_BOT - (int)((targetRateHr / trendScale) * chartH);
    if (ty >= CHART_TOP && ty <= CHART_BOT) tft.drawFastHLine(x, ty, CHART_BARW - 1, COLOR_YELLOW);
  }
  if (h <= 1) tft.drawFastHLine(x, CHART_BOT, CHART_BARW - 1, COLOR_RED);
  else        tft.fillRect(x, CHART_BOT - h, CHART_BARW - 1, h, THEME_PINK);
}

void drawPage4Framework() {
  tft.fillScreen(THEME_BG);
  drawTopBar(true);
  textAt("FLOW TREND", 12, 32, 1, UI_DIM, THEME_BG);
  textRight(padTo(targetRateHr > 0 ? ("TARGET " + String((int)(targetRateHr + 0.5f))) : String("TARGET --"), 10),
            164, 32, 1, COLOR_YELLOW, THEME_BG);
  tft.fillRoundRect(6, 216, 160, 54, 6, UI_CARD);
  textAt("NOW", 14, 222, 1, UI_DIM, UI_CARD);
  textAt("AVG 30m", 100, 222, 1, UI_DIM, UI_CARD);
  drawTrendChart();
  drawPageDots(3, 308);
  cacheP4 = "";
  stateNeedsRedraw = false;
}

