kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_5_0/ESP32-S3-Station-V_7_5_0.ino
  pinMode(BUZZER_PIN, OUTPUT); noTone(BUZZER_PIN);
  pinMode(TFT_BLK, OUTPUT); digitalWrite(TFT_BLK, HIGH);
  pinMode(BTN_PIN, INPUT_PULLUP);
  pinMode(SENSOR_AO_PIN, INPUT);

  analogReadResolution(12);
  analogSetAttenuation(ADC_11db);

  SPI_TFT.begin(TFT_SCLK, -1, TFT_MOSI, TFT_CS);
  tft.init(172, 320);
  tft.setSPISpeed(40000000);
  tft.setRotation(0);
  tft.setTextWrap(false);

  stationPrefs.begin("st_cfg", false);
  currentStationId = stationPrefs.getUChar("id", 1);
  savedChannel     = stationPrefs.getUChar("ch", DEFAULT_ESPNOW_CHANNEL);
  stationPrefs.end();
  if (currentStationId < 1 || currentStationId > 8) currentStationId = 1;
  if (savedChannel < 1 || savedChannel > MAX_WIFI_CHANNEL) savedChannel = DEFAULT_ESPNOW_CHANNEL;

  stationPrefs.begin("st_cal", true);
  valLiquid     = stationPrefs.getInt("v_liq", 1200);
  valAir        = stationPrefs.getInt("v_air", 2800);
  dropThreshold = stationPrefs.getInt("th", 2000);
  hysteresis    = stationPrefs.getInt("hys", 200);
  stationPrefs.end();

  setLedColor(0, 40, 80);
  resetTrendData();
  trendLastSample = millis();

  tft.fillScreen(THEME_BG);
  drawCenteredString("SMART IV", 60, 3, THEME_SKYBLUE, THEME_BG);
  drawCenteredString("ALERT", 92, 2, THEME_PINK, THEME_BG);

  char bedBuf[12];
  snprintf(bedBuf, sizeof(bedBuf), "BED %02d", currentStationId);
  tft.fillRoundRect(26, 140, 120, 48, 8, THEME_SKYBLUE);
  drawCenteredString(String(bedBuf), 154, 3, THEME_BG, THEME_SKYBLUE);

  drawCenteredString("Bed Station Node", 214, 1, UI_DIM, THEME_BG);
  drawCenteredString("FW v" APP_VERSION, 232, 1, THEME_SKYBLUE, THEME_BG);
  drawCenteredString("BCN Phrae Innovation", 256, 1, UI_DIM, THEME_BG);

  playWelcomeMelody();
  delay(600);

  WiFi.mode(WIFI_STA);
  WiFi.disconnect();
  WiFi.setSleep(false);
  setEspNowChannel(savedChannel);

  if (esp_now_init() != ESP_OK) {
    drawCenteredString("ESP-NOW INIT FAILED", 270, 1, COLOR_RED, THEME_BG);
    Serial.println("[STATION] ESP-NOW init FAILED");
  } else {
    esp_now_register_recv_cb(esp_now_recv_cb_t(OnTimeSyncRecv));

    esp_now_peer_info_t peerInfo = {};
    memcpy(peerInfo.peer_addr, broadcastAddress, 6);
    peerInfo.channel = 0;              // 0 = ใช้ช่องปัจจุบัน (รองรับการเปลี่ยนช่องระหว่างค้นหา Host)
    peerInfo.ifidx = WIFI_IF_STA;
    peerInfo.encrypt = false;
    esp_now_add_peer(&peerInfo);
  }

  currentState = STATE_NORMAL_VIEW;
  currentNursePage = 1;
  stateNeedsRedraw = true;
  lastUserActivityTime = millis();
  lastChannelHopTime = millis();
}

// ----------------------------------------------------------------------------
// Loop
// ----------------------------------------------------------------------------
void loop() {
  checkAnalogDrop();
  handleButton();

  unsigned long currentMillis = millis();

  if (pendingCounterReset) applyCounterReset();

  // ตรวจสอบการเชื่อมต่อกับ Host หากเกิน 5 วินาทีให้ถือว่าหลุด
  unsigned long lr = lastHostRecvTime;
  if (lr == 0 || (currentMillis > lr && currentMillis - lr > HOST_TIMEOUT_MS)) {
    isHostOnline = false;
  }
  manageChannelHunting(currentMillis);

  // สายพับ -> อัตราไหลเป็น 0
  if (isLocallyOccluded() && currentFlowRate_ml_hr != 0.0f) {
    currentFlowRate_ml_hr = 0.0f;
    currentGttMin = 0.0f;
  }
  totalVolumeMl = (float)totalDrops / (float)safeDropFactor(dropFactor);

  uint8_t alertCode = effectiveAlertCode();
  uiAlertCode = alertCode;                                // ให้ทุกหน้าจอใช้รหัสเดียวกัน
  updateTrendAccumulator(currentMillis);                  // เก็บข้อมูลกราฟตลอดเวลา
  if (!isCriticalAlert(alertCode)) snoozeUntilTime = 0;   // เหตุการณ์หายไปแล้ว ยกเลิก snooze
  handlePassiveBuzzerEngine(alertCode);
  updateStatusLed(alertCode);

  // ---- ส่งข้อมูลให้ Host ทุก 1 วินาที (ส่งแม้อยู่ในหน้าตั้งค่า) ----
  if (currentMillis - lastSendTime >= SEND_INTERVAL_MS) {
    myData.stationId       = currentStationId;
    myData.isRunning       = isRunning ? 1 : 0;
    myData.totalDrops      = totalDrops;
    myData.periodDrops     = periodDropsCounter;
    myData.flowRateHr      = isRunning ? currentFlowRate_ml_hr : 0.0f;
    myData.msSinceLastDrop = hasFirstDropOccurred ? (uint32_t)(currentMillis - lastDropTimestamp) : 0;
    if (myData.msSinceLastDrop == 0 && hasFirstDropOccurred) myData.msSinceLastDrop = 1;
    myData.batteryVolts    = readStationBattery();
    myData.flags           = nearEndAckRequest ? 0x01 : 0x00;

    if (esp_now_send(broadcastAddress, (uint8_t *)&myData, sizeof(myData)) == ESP_OK) {
      periodDropsCounter = 0;
    }
    lastSendTime = currentMillis;
  }

  if (currentState == STATE_CONFIG_ID) {
    if (stateNeedsRedraw) drawStationIdConfigFramework();
    updateStationIdConfigDynamic();

    if (currentMillis >= configAutoSaveTimeout) {
      if (tempConfigStationId != currentStationId) {
        currentStationId = tempConfigStationId;
        stationPrefs.begin("st_cfg", false);
        stationPrefs.putUChar("id", currentStationId);
        stationPrefs.end();
        // ล้างค่าของเตียงเดิม รอค่าของเตียงใหม่จาก Host
        targetRateHr = 0;
        totalPlanMl = 0;
        hostAlertCode = ALERT_NONE;
        knownResetSeq = -1;
      }
      soundStart();
      currentState = STATE_NORMAL_VIEW;
      stateNeedsRedraw = true;
    }
    return;
  }

  // ---- จัดการสถานะเตือน ----
  bool critical = isCriticalAlert(alertCode);
  if (critical && currentMillis >= snoozeUntilTime) {
    if (currentState != STATE_EMERGENCY && !isHoldUiActive) {
      currentState = STATE_EMERGENCY;
      stateNeedsRedraw = true;
    } else if (currentState == STATE_EMERGENCY && alertCode != lastEmergencyCode) {
      stateNeedsRedraw = true;
    }
  } else if (currentState == STATE_EMERGENCY) {
    currentState = STATE_NORMAL_VIEW;
    stateNeedsRedraw = true;
  }

  // ---- เตือนใกล้หมด (ไม่ใช่เหตุวิกฤต) ----
  if (!critical && isNearEndPending(alertCode) && !isHoldUiActive &&
      (currentState == STATE_NORMAL_VIEW || currentState == STATE_SCREENSAVER)) {
    currentState = STATE_NEAR_END_NOTICE;
    stateNeedsRedraw = true;
  } else if (currentState == STATE_NEAR_END_NOTICE && (critical || !isNearEndPending(alertCode))) {
    currentState = critical ? STATE_EMERGENCY : STATE_NORMAL_VIEW;
    stateNeedsRedraw = true;
  }

  // ---- Screensaver เมื่อไม่มีการใช้งาน ----
  if (currentState == STATE_NORMAL_VIEW && !isHoldUiActive &&
      currentMillis - lastUserActivityTime >= SCREENSAVER_IDLE_MS) {
    currentState = STATE_SCREENSAVER;
    stateNeedsRedraw = true;
  }

  if (!isHoldUiActive) {
    if (currentState == STATE_EMERGENCY) {
      if (stateNeedsRedraw) { drawEmergencyScreen(alertCode); updateEmergencyDynamic(); }
    }
    else if (currentState == STATE_NORMAL_VIEW) {
      if (currentNursePage == 1) {
        if (stateNeedsRedraw) { drawPage1Framework(); updatePage1Dynamic(); }
        updateDripAnimation();
      } else if (currentNursePage == 2) {
        if (stateNeedsRedraw) { drawPage2Framework(); updatePage2Dynamic(); }
      } else if (currentNursePage == 3) {
        if (stateNeedsRedraw) { drawPage3Framework(); updatePage3Dynamic(); }
      } else if (currentNursePage == 4) {
        if (stateNeedsRedraw) { drawPage4Framework(); updatePage4Dynamic(); }
      }
    }
    else if (currentState == STATE_SCREENSAVER) {
      if (stateNeedsRedraw) { drawScreensaverFramework(); updateScreensaverDynamic(); }
    }
    else if (currentState == STATE_NEAR_END_NOTICE) {
      if (stateNeedsRedraw) { drawNearEndNoticeFramework(); updateNearEndNoticeDynamic(); }
    }
    else if (currentState == STATE_CREDIT) {
      if (stateNeedsRedraw) drawDeveloperCreditScreen();
    }
  }

  static unsigned long lastDynamicUpdate = 0;
  if (currentMillis - lastDynamicUpdate >= 1000) {
    lastDynamicUpdate = currentMillis;

    if (!isHoldUiActive) {
      if (currentState == STATE_NORMAL_VIEW) {
        if (currentNursePage == 1) updatePage1Dynamic();
        else if (currentNursePage == 2) updatePage2Dynamic();
        else if (currentNursePage == 3) updatePage3Dynamic();
        else if (currentNursePage == 4) updatePage4Dynamic();
      } else if (currentState == STATE_SCREENSAVER) {
        updateScreensaverDynamic();
      } else if (currentState == STATE_EMERGENCY) {
        updateEmergencyDynamic();
      } else if (currentState == STATE_NEAR_END_NOTICE) {
        updateNearEndNoticeDynamic();
      }
    }
  }
}
